// Напишите программу, которафя принимает на вход трёхзначное число и удаляет вторую цифру этого числа

int num = new Random().Nex(100, 1000);
Console.Writeline(num);