<<<<<<< HEAD
﻿// Напишите программу, которафя принимает на вход трёхзначное число и удаляет вторую цифру этого числа

int num = new Random().Nex(100, 1000);
Console.Writeline(num);
=======
﻿int num
>>>>>>> a0d3a6b60792c864d700c9db3c74b9585857caa6
